In [1]:
import numpy as np
import pandas as pd

In [2]:
# Series
mySeries = pd.Series(data=[45,77,18,41,1,33], index=['Rohit','Gill','Virat','Shreyas','Rahul','Hardik'])

In [3]:
mySeries

Rohit      45
Gill       77
Virat      18
Shreyas    41
Rahul       1
Hardik     33
dtype: int64

In [5]:
mySeries['Shreyas']

41

In [7]:
# Add two series together

first = pd.Series([1,2,3], ['a','b','c'])
second = pd.Series([4,5,6], ['a', 'x', 'c'])

first + second

a    5.0
b    NaN
c    9.0
x    NaN
dtype: float64

In [8]:
# Data Frames

In [9]:
data = [
        ['John', 3838383822] ,
        ['Bob', 8997877772],
        ['Alice', 23455675532],
        ['Rahul', 7676575552]
]

In [30]:
data = np.array(data)

In [36]:
df = pd.DataFrame(data,['R1','R2','R3','R4'], ['Name', 'Phone Number'])

In [37]:
df

     Name Phone Number
R1   John   3838383822
R2    Bob   8997877772
R3  Alice  23455675532
R4  Rahul   7676575552

In [38]:
df['Name']

R1     John
R2      Bob
R3    Alice
R4    Rahul
Name: Name, dtype: object

In [39]:
df['Phone Number']

R1     3838383822
R2     8997877772
R3    23455675532
R4     7676575552
Name: Phone Number, dtype: object

In [40]:
df['Age'] = [22, 34, 42, 56]

In [41]:
df

     Name Phone Number  Age
R1   John   3838383822   22
R2    Bob   8997877772   34
R3  Alice  23455675532   42
R4  Rahul   7676575552   56

In [42]:
df.insert(3, "Marks", [98, 91, 78, 64], True)

In [43]:
df

     Name Phone Number  Age  Marks
R1   John   3838383822   22     98
R2    Bob   8997877772   34     91
R3  Alice  23455675532   42     78
R4  Rahul   7676575552   56     64

In [44]:
df.drop('Marks', axis=1, inplace=True)

In [45]:
df

     Name Phone Number  Age
R1   John   3838383822   22
R2    Bob   8997877772   34
R3  Alice  23455675532   42
R4  Rahul   7676575552   56

In [46]:
df.iloc[3]

Name                 Rahul
Phone Number    7676575552
Age                     56
Name: R4, dtype: object

In [47]:
df.loc['R2']

Name                   Bob
Phone Number    8997877772
Age                     34
Name: R2, dtype: object

In [48]:
df.loc[['R1', 'R2'], ['Name','Age']]

    Name  Age
R1  John   22
R2   Bob   34

In [51]:
df['Age'] > 25

R1    False
R2     True
R3     True
R4     True
Name: Age, dtype: bool

In [73]:
data = {
    'a' : [7, 3, np.NaN],
    'b' : [3, np.NaN, np.NaN],
    'c' : [9 , 3, 1]
}

In [74]:
data

{'a': [7, 3, nan], 'b': [3, nan, nan], 'c': [9, 3, 1]}

In [75]:
df = pd.DataFrame(data)

In [76]:
df

     a    b  c
0  7.0  3.0  9
1  3.0  NaN  3
2  NaN  NaN  1

In [77]:
df.dropna()

     a    b  c
0  7.0  3.0  9

In [78]:
df

     a    b  c
0  7.0  3.0  9
1  3.0  NaN  3
2  NaN  NaN  1

In [79]:
df.fillna(999)

       a      b  c
0    7.0    3.0  9
1    3.0  999.0  3
2  999.0  999.0  1

In [80]:
df

     a    b  c
0  7.0  3.0  9
1  3.0  NaN  3
2  NaN  NaN  1

In [81]:
df['c'].mean()

4.333333333333333

In [84]:
df['a'] = df['a'].fillna(df['a'].mean())

In [85]:
df

     a    b  c
0  7.0  3.0  9
1  3.0  NaN  3
2  5.0  NaN  1

In [86]:
df['b'] = df['b'].fillna(df['b'].mean())

In [87]:
df

     a    b  c
0  7.0  3.0  9
1  3.0  3.0  3
2  5.0  3.0  1

In [88]:
pd.read_csv('mydataset.csv')

      Name   Age Gender  Height  Weight
0    Alice  25.0      F     5.5    65.0
1      Bob   NaN      M     6.0    80.0
2  Charlie  35.0    NaN     NaN    77.0
3    David  45.0      M     5.8     NaN
4   Edward  55.0      M     5.9    88.0
5    Frank  40.0      M     6.1    90.0
6   George  65.0      M     6.2    75.0
7     Hank  35.0      M     5.9    77.0
8    Alice  25.0      F     5.5    65.0

In [90]:
mydf = pd.read_excel('cwc_winners.xlsx')

In [91]:
mydf

,Year,Host,Venue for Final,Team-1,Team-2,Winner,Margin
0,1975,England,Lord's,WI,Aus,WI,17 runs
1,1979,England,Lord's,WI,Eng,WI,92 runs
2,1983,England,Lord's,Ind,WI,Ind,43 runs
3,1987,India,Kolkata,Aus,Eng,Aus,7 runs
4,1992,"Australia, New Zealand",Melbourne,Pak,Eng,Pak,22 runs
5,1996,"India, Pakistan, Sri Lanka",Lahore (Gdffi),Aus,SL,SL,7 wickets
6,1999,England,Lord's,Pak,Aus,Aus,8 wickets
7,2003,South Africa,Wanderers,Aus,Ind,Aus,125 runs
8,2007,West Indies,Bridgetown,Aus,SL,Aus,53 runs
9,2011,"India, Pakistan, Sri Lanka, Bangladesh",Wankhede,SL,Ind,Ind,6 wickets
10,2015,"Australia, New Zealand",Melbourne,NZ,Aus,Aus,7 wickets

In [92]:
mydf['Winner']

0     WI
1     WI
2     Ind
3     Aus
4     Pak
5     SL
6     Aus
7     Aus
8     Aus
9     Ind
10    Aus
Name: Winner, dtype: object

In [95]:
mydf['Winner'][2]

'Ind'

In [97]:
df.to_csv('newfile.csv', index=True)

In [98]:
# Data Cleaning and Preparation

In [99]:
data = pd.read_csv('mydataset.csv')

In [100]:
data

      Name   Age Gender  Height  Weight
0    Alice  25.0      F     5.5    65.0
1      Bob   NaN      M     6.0    80.0
2  Charlie  35.0    NaN     NaN    77.0
3    David  45.0      M     5.8     NaN
4   Edward  55.0      M     5.9    88.0
5    Frank  40.0      M     6.1    90.0
6   George  65.0      M     6.2    75.0
7     Hank  35.0      M     5.9    77.0
8    Alice  25.0      F     5.5    65.0

In [101]:
data.dropna()

     Name   Age Gender  Height  Weight
0   Alice  25.0      F     5.5    65.0
4  Edward  55.0      M     5.9    88.0
5   Frank  40.0      M     6.1    90.0
6  George  65.0      M     6.2    75.0
7    Hank  35.0      M     5.9    77.0
8   Alice  25.0      F     5.5    65.0

In [102]:
data

      Name   Age Gender  Height  Weight
0    Alice  25.0      F     5.5    65.0
1      Bob   NaN      M     6.0    80.0
2  Charlie  35.0    NaN     NaN    77.0
3    David  45.0      M     5.8     NaN
4   Edward  55.0      M     5.9    88.0
5    Frank  40.0      M     6.1    90.0
6   George  65.0      M     6.2    75.0
7     Hank  35.0      M     5.9    77.0
8    Alice  25.0      F     5.5    65.0

In [103]:
data['Age']

0    25.0
1     NaN
2    35.0
3    45.0
4    55.0
5    40.0
6    65.0
7    35.0
8    25.0
Name: Age, dtype: float64

In [104]:
data['Age'].mean()

40.625

In [107]:
data['Age'] = data['Age'].fillna(data['Age'].mean())

In [108]:
data

      Name     Age Gender  Height  Weight
0    Alice  25.000      F     5.5    65.0
1      Bob  40.625      M     6.0    80.0
2  Charlie  35.000    NaN     NaN    77.0
3    David  45.000      M     5.8     NaN
4   Edward  55.000      M     5.9    88.0
5    Frank  40.000      M     6.1    90.0
6   George  65.000      M     6.2    75.0
7     Hank  35.000      M     5.9    77.0
8    Alice  25.000      F     5.5    65.0

In [110]:
data['Gender'].mode()

0    M
Name: Gender, dtype: object

In [113]:
data['Gender'] = data['Gender'].fillna(data['Gender'].mode()[0])

In [114]:
data

      Name     Age Gender  Height  Weight
0    Alice  25.000      F     5.5    65.0
1      Bob  40.625      M     6.0    80.0
2  Charlie  35.000      M     NaN    77.0
3    David  45.000      M     5.8     NaN
4   Edward  55.000      M     5.9    88.0
5    Frank  40.000      M     6.1    90.0
6   George  65.000      M     6.2    75.0
7     Hank  35.000      M     5.9    77.0
8    Alice  25.000      F     5.5    65.0

In [115]:
data['Height'].mean()

5.862500000000001

In [117]:
data['Height'] = data['Height'].fillna(data['Height'].mean())

In [118]:
data

      Name     Age Gender  Height  Weight
0    Alice  25.000      F  5.5000    65.0
1      Bob  40.625      M  6.0000    80.0
2  Charlie  35.000      M  5.8625    77.0
3    David  45.000      M  5.8000     NaN
4   Edward  55.000      M  5.9000    88.0
5    Frank  40.000      M  6.1000    90.0
6   George  65.000      M  6.2000    75.0
7     Hank  35.000      M  5.9000    77.0
8    Alice  25.000      F  5.5000    65.0

In [119]:
data['Weight'].mean()

77.125

In [121]:
data['Weight'] =  data['Weight'].fillna(data['Weight'].mean())

In [122]:
data

      Name     Age Gender  Height  Weight
0    Alice  25.000      F  5.5000  65.000
1      Bob  40.625      M  6.0000  80.000
2  Charlie  35.000      M  5.8625  77.000
3    David  45.000      M  5.8000  77.125
4   Edward  55.000      M  5.9000  88.000
5    Frank  40.000      M  6.1000  90.000
6   George  65.000      M  6.2000  75.000
7     Hank  35.000      M  5.9000  77.000
8    Alice  25.000      F  5.5000  65.000

In [124]:
data = data.drop_duplicates()

In [125]:
data

      Name     Age Gender  Height  Weight
0    Alice  25.000      F  5.5000  65.000
1      Bob  40.625      M  6.0000  80.000
2  Charlie  35.000      M  5.8625  77.000
3    David  45.000      M  5.8000  77.125
4   Edward  55.000      M  5.9000  88.000
5    Frank  40.000      M  6.1000  90.000
6   George  65.000      M  6.2000  75.000
7     Hank  35.000      M  5.9000  77.000

In [126]:
data.dtypes

Name       object
Age       float64
Gender     object
Height    float64
Weight    float64
dtype: object

In [128]:
data = data.copy()
data['Age'] = data['Age'].astype(int)

In [129]:
data.dtypes

Name       object
Age         int64
Gender     object
Height    float64
Weight    float64
dtype: object

In [130]:
data

      Name  Age Gender  Height  Weight
0    Alice   25      F  5.5000  65.000
1      Bob   40      M  6.0000  80.000
2  Charlie   35      M  5.8625  77.000
3    David   45      M  5.8000  77.125
4   Edward   55      M  5.9000  88.000
5    Frank   40      M  6.1000  90.000
6   George   65      M  6.2000  75.000
7     Hank   35      M  5.9000  77.000

In [132]:
data.to_csv('newcleandataset.csv', index=False)

In [135]:
pd.read_csv('cleandataset.csv')

   Unnamed: 0     Name  Age Gender  Height  Weight
0           0    Alice   25      F  5.5000  65.000
1           1      Bob   40      M  6.0000  80.000
2           2  Charlie   35      M  5.8625  77.000
3           3    David   45      M  5.8000  77.125
4           4   Edward   55      M  5.9000  88.000
5           5    Frank   40      M  6.1000  90.000
6           6   George   65      M  6.2000  75.000
7           7     Hank   35      M  5.9000  77.000

In [136]:
pd.read_csv('newcleandataset.csv')

      Name  Age Gender  Height  Weight
0    Alice   25      F  5.5000  65.000
1      Bob   40      M  6.0000  80.000
2  Charlie   35      M  5.8625  77.000
3    David   45      M  5.8000  77.125
4   Edward   55      M  5.9000  88.000
5    Frank   40      M  6.1000  90.000
6   George   65      M  6.2000  75.000
7     Hank   35      M  5.9000  77.000